{
    "Viral Upper Respiratory Tract Infection (Common Cold)**": "Based on the symptom of \"common cold\", here's my analysis:\n\n**Symptoms:** Common cold (no further details provided)\n\nAfter considering the symptoms, I can suggest a possible diagnosis.\n\n**The most likely diagnosis based on the symptoms is: Viral Upper Respiratory Tract Infection (Common Cold)**\n**The severity level is: BLUE**\n\nBased on the severity level guidelines:\n\nSince the severity level is **BLUE** (20-40), the recommended actions are:\n\n* Mild issue. Suggest home remedies.\n* Rest, hydration, and over-the-counter medications like pain relievers or decongestants can help alleviate symptoms.\n* If symptoms worsen or persist for an extended period, consider consulting a doctor.\n\nPlease note that this is a relatively mild condition, and most people recover within a few days. However, if your symptoms worsen or you experience difficulty breathing, chest pain, or severe headache, seek medical attention immediately.",
    "**Common Cold**": "Based on your report of \"I am experiencing symptoms of a common cold\", I'll proceed with the analysis.\n\n1. Reading through the symptoms carefully:\n\t* Since you haven't provided specific details about the symptoms, I will assume it's a general feeling of having a common cold.\n2. Providing my assessment:\n\nThe most likely diagnosis based on the symptoms is: **Common Cold**\nThe severity level is: **GREEN**\n\nAs per our severity level guidelines, since the severity level is GREEN (0-20), this indicates that there are no significant health problems associated with your reported symptoms. In this case, you can try some basic remedies at home to alleviate your symptoms.\n\nRecommended actions:\n\n* Stay hydrated by drinking plenty of fluids.\n* Use a humidifier or inhale steam from a bowl of hot water to ease congestion.\n* Gargle with salt water to soothe a sore throat.\n* Get plenty of rest and take over-the-counter medications like acetaminophen (Tylenol) or ibuprofen (Advil, Motrin) for relief.\n\nPlease note that if your symptoms worsen or you experience any unusual symptoms such as difficulty breathing, chest pain, or fever above 102°F (39°C), you should seek medical attention immediately.",
    "**URTI (Upper Respiratory Tract Infection)**": "I'll do my best to help you diagnose your condition.\n\n**Step 1: Analyzing symptoms**\n\nYou have reported two main symptoms:\n\n* A blocked nose\n* Slit congestion in the chest (which I assume means shallow or labored breathing)\n\nThese symptoms can be associated with several conditions, but I will consider the most likely possibilities based on these symptoms alone.\n\n**Step 2: Potential diagnoses**\n\nPossible diagnoses for your symptoms include:\n\n1. Upper Respiratory Tract Infection (URTI): A viral infection affecting the nose and throat.\n2. Asthma or Chronic Obstructive Pulmonary Disease (COPD) exacerbation: These conditions can cause breathing difficulties, which may be exacerbated by congestion in the chest.\n3. Sinusitis: An inflammation of the sinuses, which can lead to nasal congestion.\n\nHowever, given that you have not mentioned other symptoms such as fever, cough, or difficulty speaking, I will prioritize the most likely diagnosis based on your provided symptoms.\n\n**Step 3: Assessment and recommended actions**\n\nThe most likely diagnosis based on the symptoms is: **URTI (Upper Respiratory Tract Infection)**\n\nSeverity level is: **ORANGE (70-79)**\n\nRecommended Actions:\n\nGiven a severity level of ORANGE, I recommend that you consult a doctor soon to determine the best course of treatment. You can also try some basic remedies such as staying hydrated by drinking plenty of fluids, using saline nasal sprays or drops to help clear your nose, and taking over-the-counter medications like acetaminophen (Tylenol) for fever reduction.\n\nPlease note that if your symptoms worsen or you experience difficulty breathing, chest pain, or a persistent cough with yellow or green mucus, seek medical attention immediately.",
    "**acute bronchitis (a type of respiratory infection affecting the bronchi)": "Based on your reported symptom of \"chest congestion\", I will follow the steps to provide a potential diagnosis and recommended actions.\n\n**Symptom Analysis:**\nChest congestion can have multiple causes, but some possible explanations could include respiratory issues like bronchitis or asthma, heart conditions such as angina, or even psychological factors leading to anxiety attacks. However, given that you only mentioned chest congestion without specifying any other symptoms, I'll narrow down the list of potential diagnoses.\n\n**Assessment:**\nThe most likely diagnosis based on the symptoms is: **Acute Bronchitis (a type of respiratory infection affecting the bronchi)**\nThe severity level is: **YELLOW (40-60)**\n\n**Recommended Actions Based on Severity Level Guidelines Provided Above:**\nFor a Yellow-level symptom, I recommend visiting a clinic or taking an online consultation for further evaluation and advice. In the meantime, here are some basic remedies you can try:\n\n1. Stay hydrated by drinking plenty of fluids to help loosen mucus.\n2. Use a humidifier to ease congestion.\n3. Gargle with warm salt water to soothe your throat.\n4. Try over-the-counter medications like acetaminophen or cough syrup for relief.\n\n**Follow-up:**\nPlease note that this is just an initial assessment, and actual diagnosis can only be confirmed by a healthcare professional. If you experience any of the following, please seek immediate medical attention:\n\n- Severe chest pain or pressure\n- Difficulty breathing or shortness of breath\n- Fever over 102°F (39°C)\n- Coughing up blood or yellowish-green mucus\n\nRemember, it's always best to consult a doctor for a proper evaluation and guidance.",
    "** **contact dermatitis (or possibly insect bite reaction)": "**Step 1: Analyzing Symptoms**\n\nYou've mentioned having rashes on your skin. This symptom alone is quite broad and could point to several potential diagnoses depending on additional factors such as their location, duration, nature (itchy, painful, etc.), and any accompanying symptoms like fever, itching, or swelling.\n\n**Potential Diagnoses:**\n\n1. **Eczema:** A common condition characterized by skin irritation that can cause rashes and itchy skin. However, this would be more likely if you mentioned itching alongside the rash.\n   \n2. **Insect Bite Reaction:** If you've been in areas with insects (such as mosquitoes or bed bugs) recently, a rash could indicate an allergic reaction to their bites.\n\n3. **Contact Dermatitis:** This is a condition that causes skin irritation and rashes due to coming into contact with something your skin finds irritating, such as soap, detergent, or even certain metals.\n\n4. **Skin Allergies:** If you mentioned any recent introduction of new foods, soaps, detergents, or other products, it could point towards an allergic reaction causing the rash.\n\n5. **Fungal or Bacterial Infections:** Though less likely without additional symptoms like fever, rashes can sometimes be a sign of infections caused by fungi (like ringworm) or bacteria.\n\n**Assessment:**\n\nGiven the information provided, I'll take a conservative approach and suggest possible diagnoses based on common skin issues that could cause rashes. However, to narrow down the exact diagnosis, it would be helpful to know more about your symptoms, such as their location, duration, whether they are painful or itchy, and if you've introduced any new substances into your environment recently.\n\n**The most likely diagnosis based on the symptoms is:** **Contact Dermatitis (or possibly Insect Bite Reaction)**\n**Severity level is:** **YELLOW (40-60)**\n\n**Recommended Actions Based on Severity Level:**\n\nFor a YELLOW (40-60) severity level, it's advisable to visit a Clinic or take an online consultation for further assessment. The doctor can perform a physical examination and ask questions about your symptoms to narrow down the exact cause of the rash.\n\nPlease provide more details if you're willing, as this will help in making a more precise diagnosis.",
    "**common cold or viral upper respiratory tract infection (urti)": "**Symptom Analysis**\n\nBased on your reported symptoms of a \"running nose\" and \"headache\", I'll provide an assessment.\n\n**Assessment:**\n\nThe most likely diagnosis based on the symptoms is: **Common Cold or Viral Upper Respiratory Tract Infection (URTI)**\nThe severity level is: **ORANGE (65)**\n\n**Recommended Actions Based on Severity Level:**\n\nAs per the severity level guidelines, since it's ORANGE (65), I recommend:\n\n* Consult a doctor soon to get an accurate diagnosis and guidance.\n* Until then, follow basic remedies such as:\n\t+ Staying hydrated with plenty of fluids (water, tea, or soup)\n\t+ Using saline nasal sprays or drops to ease congestion\n\t+ Taking over-the-counter pain relievers like acetaminophen (Tylenol) for headache\n\t+ Getting plenty of rest and avoiding strenuous activities\n\n**Note:** If symptoms worsen, such as difficulty breathing, severe headaches, or high fever, seek immediate medical attention.\n\nLet me know if you have any further questions or concerns!",
    "infection (likely viral or bacterial)": "I'll follow the steps to provide a diagnosis and recommended actions.\n\n**Symptoms:** Fever\n\n**Step 1: Analyze symptoms**\n\nA fever is an increase in body temperature above the normal range (usually above 100.4°F or 38°C). There are many possible causes of fever, including infections, inflammation, and autoimmune disorders. However, without additional information, it's difficult to pinpoint a specific diagnosis.\n\n**Step 2: Provide assessment**\n\nBased on the symptom \"fever\" alone, I'll provide a general assessment:\n\nThe most likely diagnosis based on the symptoms is: Infection (likely viral or bacterial)\nThe severity level is: ORANGE\n\n**Recommended actions:**\nConsult a doctor soon and follow basic remedies until then. This includes:\n- Staying hydrated by drinking plenty of fluids\n- Resting to help your body fight off the infection\n- Using over-the-counter medications like acetaminophen (Tylenol) or ibuprofen (Advil, Motrin) to reduce fever\n\n**Severity Level Explanation:**\nSince we don't have any additional information about the fever's severity, duration, or other symptoms, I've chosen ORANGE as the severity level. This indicates that you should consult a doctor soon for further evaluation and guidance.\n\nPlease provide more information if available (e.g., fever duration, recent travel history, contact with anyone who has been sick), so I can refine the diagnosis and recommended actions!",
    "**tension headache or mild migraine": "Based on your symptom of a headache, I will follow the steps to provide an assessment.\n\n**Step 1: Analyze the symptoms**\n\nYou have reported one symptom: a headache.\n\n**Step 2: Provide my assessment**\n\nGiven the single symptom, I can consider various possible causes. The most likely diagnosis based on this symptom is:\n\nThe most likely diagnosis based on the symptoms is: **Tension Headache or Mild Migraine**\n \nI am assigning a severity level of **YELLOW (40-60)**.\n\n**Recommended Actions Based on Severity Level**\n\nSince the severity level falls under YELLOW, I recommend you to visit a clinic or take an online consultation for further evaluation and advice. The doctor can assess your symptoms in more detail, ask additional questions, and provide a more accurate diagnosis.\n\nPlease note that if you experience any of the following, seek immediate medical attention:\n\n* Sudden, severe headache\n* Headache accompanied by fever, confusion, or stiff neck\n* Worsening headache over time\n\nIf no specific concerns like those mentioned above are present, this assessment is still valid. However, it's always better to consult a healthcare professional for personalized advice.\n\nIs there anything else you'd like me to consider or any additional information you can provide?"
}